; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v12 ?v4)
             (pred_3 ?v8 ?v10)
             (pred_8 ?v12 ?v10)
             (pred_12 ?v2 ?v12 )
	     (pred_1 ?v12)
             (pred_4 ?v1)
             (pred_7 ?v8)
             (pred_2 ?v10)
             (pred_5 ?v12)
             (pred_9 ?v8)
             (pred_11 ?v12)
             (pred_6 ))



(:action op_3
:parameters (?v9 ?v13 ?v11 ?v7)
:precondition (and (pred_4 ?v9) (pred_4 ?v13) (pred_7 ?v11) (pred_2 ?v7)
          (pred_10 ?v9 ?v13) (pred_3 ?v11 ?v7)
                   (pred_8 ?v13 ?v7) (pred_1 ?v9) 
                   (pred_5 ?v13) (pred_9 ?v11))
:effect (and  (pred_11 ?v13) (not (pred_5 ?v13))))


(:action op_4
:parameters (?v9 ?v5)
:precondition (and (pred_4 ?v9) (pred_4 ?v5)
               (pred_1 ?v9) (pred_10 ?v9 ?v5) (pred_11 ?v5))
:effect (and (pred_1 ?v5) (not (pred_1 ?v9))))

(:action op_5
:parameters (?v9 ?v11)
:precondition (and (pred_4 ?v9) (pred_7 ?v11) 
                  (pred_1 ?v9) (pred_12 ?v11 ?v9) (pred_6 ))
:effect (and (pred_9 ?v11)
   (not (pred_12 ?v11 ?v9)) (not (pred_6 ))))


(:action op_1
:parameters (?v9 ?v3 ?v6)
:precondition (and (pred_4 ?v9) (pred_7 ?v3) (pred_7 ?v6)
                  (pred_1 ?v9) (pred_9 ?v6) (pred_12 ?v3 ?v9))
:effect (and (pred_9 ?v3) (pred_12 ?v6 ?v9)
        (not (pred_9 ?v6)) (not (pred_12 ?v3 ?v9))))

(:action op_2
:parameters (?v9 ?v11)
:precondition (and (pred_4 ?v9) (pred_7 ?v11) 
                  (pred_1 ?v9) (pred_9 ?v11))
:effect (and (pred_6 ) (pred_12 ?v11 ?v9) (not (pred_9 ?v11)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_23 obj_14 obj_24 obj_07 obj_30 obj_21 obj_13 obj_18 obj_17 obj_25 obj_20 obj_10 obj_28 obj_26 obj_05 obj_02 obj_12 obj_27 obj_09 obj_03 obj_29 obj_15 obj_08 obj_22 obj_04
    obj_16 obj_01
    obj_11 obj_06 obj_19
    )

    (:init
       (pred_6)

       (pred_4 obj_23)
       (pred_4 obj_14)
       (pred_4 obj_24)
       (pred_4 obj_07)
       (pred_4 obj_30)
       (pred_4 obj_21)
       (pred_4 obj_13)
       (pred_4 obj_18)
       (pred_4 obj_17)
       (pred_4 obj_25)
       (pred_4 obj_20)
       (pred_4 obj_10)
       (pred_4 obj_28)
       (pred_4 obj_26)
       (pred_4 obj_05)
       (pred_4 obj_02)
       (pred_4 obj_12)
       (pred_4 obj_27)
       (pred_4 obj_09)
       (pred_4 obj_03)
       (pred_4 obj_29)
       (pred_4 obj_15)
       (pred_4 obj_08)
       (pred_4 obj_22)
       (pred_4 obj_04)
       (pred_2 obj_16)
       (pred_2 obj_01)
       (pred_7 obj_11)
       (pred_7 obj_06)
       (pred_7 obj_19)

       (pred_10 obj_23 obj_21)
       (pred_10 obj_23 obj_14)
       (pred_10 obj_14 obj_13)
       (pred_10 obj_14 obj_24)
       (pred_10 obj_14 obj_23)
       (pred_10 obj_24 obj_18)
       (pred_10 obj_24 obj_07)
       (pred_10 obj_24 obj_14)
       (pred_10 obj_07 obj_17)
       (pred_10 obj_07 obj_30)
       (pred_10 obj_07 obj_24)
       (pred_10 obj_30 obj_25)
       (pred_10 obj_30 obj_07)
       (pred_10 obj_21 obj_20)
       (pred_10 obj_21 obj_13)
       (pred_10 obj_21 obj_23)
       (pred_10 obj_13 obj_10)
       (pred_10 obj_13 obj_18)
       (pred_10 obj_13 obj_14)
       (pred_10 obj_13 obj_21)
       (pred_10 obj_18 obj_28)
       (pred_10 obj_18 obj_17)
       (pred_10 obj_18 obj_24)
       (pred_10 obj_18 obj_13)
       (pred_10 obj_17 obj_26)
       (pred_10 obj_17 obj_25)
       (pred_10 obj_17 obj_07)
       (pred_10 obj_17 obj_18)
       (pred_10 obj_25 obj_05)
       (pred_10 obj_25 obj_30)
       (pred_10 obj_25 obj_17)
       (pred_10 obj_20 obj_02)
       (pred_10 obj_20 obj_10)
       (pred_10 obj_20 obj_21)
       (pred_10 obj_10 obj_12)
       (pred_10 obj_10 obj_28)
       (pred_10 obj_10 obj_13)
       (pred_10 obj_10 obj_20)
       (pred_10 obj_28 obj_27)
       (pred_10 obj_28 obj_26)
       (pred_10 obj_28 obj_18)
       (pred_10 obj_28 obj_10)
       (pred_10 obj_26 obj_09)
       (pred_10 obj_26 obj_05)
       (pred_10 obj_26 obj_17)
       (pred_10 obj_26 obj_28)
       (pred_10 obj_05 obj_03)
       (pred_10 obj_05 obj_25)
       (pred_10 obj_05 obj_26)
       (pred_10 obj_02 obj_29)
       (pred_10 obj_02 obj_12)
       (pred_10 obj_02 obj_20)
       (pred_10 obj_12 obj_15)
       (pred_10 obj_12 obj_27)
       (pred_10 obj_12 obj_10)
       (pred_10 obj_12 obj_02)
       (pred_10 obj_27 obj_08)
       (pred_10 obj_27 obj_09)
       (pred_10 obj_27 obj_28)
       (pred_10 obj_27 obj_12)
       (pred_10 obj_09 obj_22)
       (pred_10 obj_09 obj_03)
       (pred_10 obj_09 obj_26)
       (pred_10 obj_09 obj_27)
       (pred_10 obj_03 obj_04)
       (pred_10 obj_03 obj_05)
       (pred_10 obj_03 obj_09)
       (pred_10 obj_29 obj_15)
       (pred_10 obj_29 obj_02)
       (pred_10 obj_15 obj_08)
       (pred_10 obj_15 obj_12)
       (pred_10 obj_15 obj_29)
       (pred_10 obj_08 obj_22)
       (pred_10 obj_08 obj_27)
       (pred_10 obj_08 obj_15)
       (pred_10 obj_22 obj_04)
       (pred_10 obj_22 obj_09)
       (pred_10 obj_22 obj_08)
       (pred_10 obj_04 obj_03)
       (pred_10 obj_04 obj_22)
       (pred_5 obj_17)
       (pred_5 obj_05)
       (pred_5 obj_13)
       (pred_8  obj_17 obj_16)
       (pred_8  obj_05 obj_01)
       (pred_8  obj_13 obj_01)
       (pred_11 obj_23)
       (pred_11 obj_14)
       (pred_11 obj_24)
       (pred_11 obj_07)
       (pred_11 obj_30)
       (pred_11 obj_21)
       (pred_11 obj_18)
       (pred_11 obj_25)
       (pred_11 obj_20)
       (pred_11 obj_10)
       (pred_11 obj_28)
       (pred_11 obj_26)
       (pred_11 obj_02)
       (pred_11 obj_12)
       (pred_11 obj_27)
       (pred_11 obj_09)
       (pred_11 obj_03)
       (pred_11 obj_29)
       (pred_11 obj_15)
       (pred_11 obj_08)
       (pred_11 obj_22)
       (pred_11 obj_04)

       (pred_3  obj_11 obj_16)
       (pred_3  obj_06 obj_01)
       (pred_3  obj_19 obj_01)
       (pred_12 obj_11 obj_26)
       (pred_12 obj_06 obj_09)
       (pred_12 obj_19 obj_28)
       (pred_1 obj_07)
    )

    (:goal (and
       (pred_12 obj_06 obj_10)
       (pred_12 obj_19 obj_20)
    ))
(:constraints
  (always (not (pred_1 obj_18)))
)
)

; plan
1. (op_4 obj_07 obj_24)
   deleted: (pred_1 obj_07)
   added: (pred_1 obj_24)
   goals met: 0 of 2
2. (op_4 obj_24 obj_14)
   deleted: (pred_1 obj_24)
   added: (pred_1 obj_14)
   goals met: 0 of 2
3. (op_4 obj_14 obj_23)
   deleted: (pred_1 obj_14)
   added: (pred_1 obj_23)
   goals met: 0 of 2
4. (op_4 obj_23 obj_21)
   deleted: (pred_1 obj_23)
   added: (pred_1 obj_21)
   goals met: 0 of 2
5. (op_4 obj_21 obj_20)
   deleted: (pred_1 obj_21)
   added: (pred_1 obj_20)
   goals met: 0 of 2
6. (op_4 obj_20 obj_10)
   deleted: (pred_1 obj_20)
   added: (pred_1 obj_10)
   goals met: 0 of 2
7. (op_4 obj_10 obj_28)
   deleted: (pred_1 obj_10)
   added: (pred_1 obj_28)
   goals met: 0 of 2
8. (op_4 obj_28 obj_26)
   deleted: (pred_1 obj_28)
   added: (pred_1 obj_26)
   goals met: 0 of 2
9. (op_4 obj_26 obj_09)
   deleted: (pred_1 obj_26)
   added: (pred_1 obj_09)
   goals met: 0 of 2
10. (op_5 obj_09 obj_06)
   deleted: (pred_12 obj_06 obj_09) (pred_6)
   added: (pred_9 obj_06)
   goals met: 0 of 2
11. (op_4 obj_09 obj_26)
   deleted: (pred_1 obj_09)
   added: (pred_1 obj_26)
   goals met: 0 of 2
12. (op_4 obj_26 obj_28)
   deleted: (pred_1 obj_26)
   added: (pred_1 obj_28)
   goals met: 0 of 2
13. (op_4 obj_28 obj_10)
   deleted: (pred_1 obj_28)
   added: (pred_1 obj_10)
   goals met: 0 of 2
14. (op_2 obj_10 obj_06)
   deleted: (pred_9 obj_06)
   added: (pred_6) (pred_12 obj_06 obj_10)
   goals met: 1 of 2
15. (op_4 obj_10 obj_28)
   deleted: (pred_1 obj_10)
   added: (pred_1 obj_28)
   goals met: 1 of 2
16. (op_5 obj_28 obj_19)
   deleted: (pred_12 obj_19 obj_28) (pred_6)
   added: (pred_9 obj_19)
   goals met: 1 of 2
17. (op_4 obj_28 obj_10)
   deleted: (pred_1 obj_28)
   added: (pred_1 obj_10)
   goals met: 1 of 2
18. (op_4 obj_10 obj_20)
   deleted: (pred_1 obj_10)
   added: (pred_1 obj_20)
   goals met: 1 of 2
19. (op_2 obj_20 obj_19)
   deleted: (pred_9 obj_19)
   added: (pred_6) (pred_12 obj_19 obj_20)
   goals met: 2 of 2
